InformationRegisters/КлассыУсловийТрудаПоДолжностям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КлассыУсловийТрудаПоДолжностям</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлассУсловийТруда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыявленыВредныеОпасныеФакторы</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РезультатыСпецоценкиУсловийТруда</v8:Type>
						<v8:Type>cfg:DocumentRef.УтверждениеШтатногоРасписания</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеШтатногоРасписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УсловияТруда</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КлассыУсловийТрудаПоДолжностям/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьВыявленныеВредныеФакторыСОУТ");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиОбновления

// Параметры:
//  ПараметрыОбновления - Структура - параметры обработчика обновления.
Процедура ЗаполнитьВыявленныеВредныеФакторыСОУТ(ПараметрыОбновления) Экспорт

	ВредныеКлассы = КлассыУсловийТрудаКлиентСервер.ВредныеИОпасныеКлассыУсловийТруда();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВредныеКлассы", ВредныеКлассы);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КлассыУТ.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.КлассыУсловийТрудаПоДолжностям КАК КлассыУТ
		|ГДЕ
		|	КлассыУТ.КлассУсловийТруда В (&ВредныеКлассы)
		|	И НЕ КлассыУТ.ВыявленыВредныеОпасныеФакторы";

	ОбновляемыеДанные =
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);
	
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПродолжитьОбработчик(ПараметрыОбновления);
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.КлассыУсловийТрудаПоДолжностям;
	ПолноеИмяРегистра = МетаданныеРегистра.ПолноеИмя();
	
	Выборка = ОбновляемыеДанные.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Должность.Установить(Выборка.Должность);

		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра);
			ЭлементБлокировки.УстановитьЗначение("Должность", Выборка.Должность);
			Блокировка.Заблокировать();

			НаборЗаписей.Прочитать();

			ЕстьИзменения = Ложь;
			ДокументыОснования = Новый Соответствие;
			Для Каждого Запись Из НаборЗаписей Цикл
				Если ВредныеКлассы.Найти(Запись.КлассУсловийТруда) <> Неопределено И Не Запись.ВыявленыВредныеОпасныеФакторы Тогда
					Запись.ВыявленыВредныеОпасныеФакторы = Истина;
					ЕстьИзменения = Истина;
					Если ЗначениеЗаполнено(Запись.Основание) Тогда
						ДокументыОснования.Вставить(Запись.Основание, Истина);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;

			Если ЕстьИзменения Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			КонецЕсли;

			Для Каждого КлючИЗначение Из ДокументыОснования Цикл
				КлассыУсловийТруда.ОбновитьВыявленныеВредныеФакторыВДокументеОснования(
					КлючИЗначение.Ключ, Выборка.Должность, ВредныеКлассы);
			КонецЦикла;

			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка, МетаданныеРегистра, ,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
